# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности

def onceTime(mas):
    print(set(mas))

row = [1, 3, 66, 66, 69, 96]
onceTime(row)